app/controllers/comments_controller.rb

  def create
  	comment = Comment.new(params[:comment])
  		if comment.save
---
INSERT INTO "comments" ("author", "content", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Ben"], ["content", "This is cool"], ["created_at", Sat, 22 Jun 2013 18:15:14 UTC +00:00], ["product_id", nil], ["updated_at", Sat, 22 Jun 2013 18:15:14 UTC +00:00]]