app/controllers/products_controller.rb

	def create
		@product = Product.new(params[:product])
		if @product.save
---
INSERT INTO "products" ("created_at", "description", "name", "pricing", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 18 Jun 2013 22:12:21 UTC +00:00], ["description", "Cool Computer"], ["name", "Dell"], ["pricing", 150.0], ["updated_at", Tue, 18 Jun 2013 22:12:21 UTC +00:00]]

	def update
		@product = Product.find(params[:id])
		if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "products" SET "pricing" = 500.0, "description" = 'We should see how this works', "updated_at" = '2013-06-19 00:19:00.967370' WHERE "products"."id" = 3