app/views/products/edit.html.erb

SELECT "categories".* FROM "categories"
---
		<%= f.input :description, :as => :text, :input_html => { :rows => 4, :cols=> 2} %>
		<%= f.collection_select :category_id, Category.all, :id, :name %><br>